phl104/midterm-review.tex
% Created 2016-10-18 Tue 12:14
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{listings}
\author{Daniel Dyla}
\date{\today}
\title{midterm-review}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\section{Principle of utility}
\label{sec-1}

If an act or rule is right it will bring about the greatest pleasure
for the greatest number of people.

\section{Rule/Indirect utilitarianism}
\label{sec-2}

Follow the rules. A rule is a good rule if it generally brings the
greatest amount of pleasure for the greatest number of people


\section{Bentham vs Mill}
\label{sec-3}

Bentham believed that you should do whatever brings you the most
pleasure.

Mill believed that you should do whatever brings the most pleasure to
the greatest number of people.

\section{Psychological vs Ethical Egoism}
\label{sec-4}

Psychological Egoism holds that a person \uline{will} do whatever is best
for themselves.

Ethical Egoism holds that a person \uline{should} do whatever is best for
themselves.

\section{Telos of a human being}
\label{sec-5}

Rationality/Happiness

\section{Rights in the state of nature according to Hobbes}
\label{sec-6}

A person has the right to do whatever is necessary to preserve one's
own life.

\section{Prisoner's Dilemma}
\label{sec-7}

Attack neighbor or don't.

Rat on cellmate or don't.

\section{Subjective theory of value}
\label{sec-8}

An act only has value because we perceive it to have value based on
our own wants. Nothing has any intrinsic value.

\section{Categorical Imperative}
\label{sec-9}

\subsection{Part 1}
\label{sec-9-1}

Act in such a way that the maxim of your action could become universal
law.

This is a problem because some things could be willed to become
universal law that are generally considered bad.

\subsection{Part 2}
\label{sec-9-2}

Treat every human being as an end in himself and not just a means to
your own end

\section{Theological Ethics}
\label{sec-10}

It is a problem if god arbitrarily decides what is good and bad
because there is no way to know what to do in any situation not
covered by something god has said.

It is a problem if god has a reason for what is good and bad because
then he is cut out of the equation. You could simply follow the same
philosophy god follows without having god in the mix.

\section{Autonomous/Heteronomous will}
\label{sec-11}

Autonomous will is "self law" - Being controlled wholly by your own
thoughts and desires

Heteronomous will is "other law" - Being controlled by outside forces

\section{Kant vs Utilitarian}
\label{sec-12}

In some situations a utilitarian would say it is acceptable to use a
person as a mere means to an end in which pleasure is brought to a
great number of people.

\section{Utilitarian Promises}
\label{sec-13}

If I promise someone I will do something, and they die. It can now
cause them no displeasure for me to keep my promise, therefore I can
break it if it is pleasing to me.

\section{Moral vs Value theory}
\label{sec-14}

Value is a personal belief. "It is wrong to kill people"

Moral is a system of beliefs for deciding between good and bad.

\section{Inclination and Kant}
\label{sec-15}

Kant believes that actions we perform because we are inclined to do so
are not morally praiseworthy.

If I help my mom because I like helping my mom, I did it because I
wanted to, not because I know it is the right thing to do.
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}
